load_testing/results_for_report/key-value/dyn_3_peaks_360s_10keys_500r.txt
wrk -t2 -c200 --timeout 15s --latency -s readLineByLine.lua -d360s -R500 http://172.31.0.222:3000/ 
CONNECTED to addr       172.31.0.222:3000
CONNECTED to addr       172.31.3.106:3000
all addrs:
1       172.31.0.222:3000
2       172.31.3.106:3000
thread addr: 172.31.0.222:3000
all addrs:
1       172.31.0.222:3000
2       172.31.3.106:3000
thread addr: 172.31.3.106:3000
Running 6m test @ http://172.31.0.222:3000/
  2 threads and 200 connections
  Thread calibration: mean lat.: 8.356ms, rate sampling interval: 52ms
  Thread calibration: mean lat.: 8.124ms, rate sampling interval: 50ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     6.67ms    9.30ms 457.47ms   87.06%
    Req/Sec   252.12     80.06   591.00     75.40%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.81ms
 75.000%    4.87ms
 90.000%   19.71ms
 99.000%   38.56ms
 99.900%   81.02ms
 99.990%  166.53ms
 99.999%  229.38ms
100.000%  457.73ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       1.376     0.000000            1         1.00
       1.994     0.100000        17476         1.11
       2.229     0.200000        34961         1.25
       2.429     0.300000        52515         1.43
       2.615     0.400000        70012         1.67
       2.811     0.500000        87511         2.00
       2.933     0.550000        96210         2.22
       3.089     0.600000       104886         2.50
       3.305     0.650000       113612         2.86
       3.683     0.700000       122321         3.33
       4.871     0.750000       131042         4.00
       6.767     0.775000       135412         4.44
      10.055     0.800000       139778         5.00
      11.519     0.825000       144161         5.71
      13.439     0.850000       148522         6.67
      16.591     0.875000       152883         8.00
      18.143     0.887500       155091         8.89
      19.711     0.900000       157259        10.00
      21.679     0.912500       159454        11.43
      23.407     0.925000       161620        13.33
      24.703     0.937500       163803        16.00
      25.359     0.943750       164898        17.78
      26.047     0.950000       165997        20.00
      26.767     0.956250       167081        22.86
      27.695     0.962500       168174        26.67
      28.799     0.968750       169267        32.00
      29.407     0.971875       169813        35.56
      30.159     0.975000       170364        40.00
      31.071     0.978125       170900        45.71
      32.415     0.981250       171450        53.33
      34.015     0.984375       171998        64.00
      34.943     0.985938       172267        71.11
      35.967     0.987500       172538        80.00
      37.439     0.989062       172813        91.43
      39.263     0.990625       173086       106.67
      41.663     0.992188       173357       128.00
      43.167     0.992969       173495       142.22
      44.863     0.993750       173633       160.00
      47.135     0.994531       173767       182.86
      49.951     0.995313       173905       213.33
      53.183     0.996094       174040       256.00
      55.039     0.996484       174110       284.44
      57.855     0.996875       174177       320.00
      60.255     0.997266       174246       365.71
      63.679     0.997656       174313       426.67
      67.903     0.998047       174381       512.00
      69.759     0.998242       174415       568.89
      72.895     0.998437       174449       640.00
      74.559     0.998633       174485       731.43
      78.079     0.998828       174518       853.33
      81.471     0.999023       174554      1024.00
      84.927     0.999121       174569      1137.78
      87.295     0.999219       174586      1280.00
      91.711     0.999316       174603      1462.86
      95.743     0.999414       174621      1706.67
     100.159     0.999512       174637      2048.00
     103.103     0.999561       174646      2275.56
     105.727     0.999609       174654      2560.00
     114.431     0.999658       174663      2925.71
     120.383     0.999707       174671      3413.33
     129.343     0.999756       174680      4096.00
     135.167     0.999780       174684      4551.11
     137.599     0.999805       174688      5120.00
     145.535     0.999829       174693      5851.43
     149.503     0.999854       174697      6826.67
     158.207     0.999878       174701      8192.00
     163.455     0.999890       174703      9102.22
     166.527     0.999902       174705     10240.00
     174.079     0.999915       174708     11702.86
     176.767     0.999927       174710     13653.33
     182.527     0.999939       174712     16384.00
     184.703     0.999945       174713     18204.44
     186.239     0.999951       174714     20480.00
     200.959     0.999957       174715     23405.71
     201.343     0.999963       174716     27306.67
     201.599     0.999969       174717     32768.00
     206.335     0.999973       174718     36408.89
     206.335     0.999976       174718     40960.00
     209.919     0.999979       174719     46811.43
     209.919     0.999982       174719     54613.33
     229.375     0.999985       174720     65536.00
     229.375     0.999986       174720     72817.78
     229.375     0.999988       174720     81920.00
     250.111     0.999989       174721     93622.86
     250.111     0.999991       174721    109226.67
     250.111     0.999992       174721    131072.00
     250.111     0.999993       174721    145635.56
     250.111     0.999994       174721    163840.00
     457.727     0.999995       174722    187245.71
     457.727     1.000000       174722          inf
#[Mean    =        6.674, StdDeviation   =        9.302]
#[Max     =      457.472, Total count    =       174722]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  179961 requests in 6.00m, 46.23MB read
Requests/sec:    499.88
Transfer/sec:    131.50KB
thread 0 made 89983 requests and got 89980 responses
thread 1 made 89982 requests and got 89981 responses
2022-06-05 05:37:13.898 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: NaN 
2022-06-05 05:37:18.906 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.9047619047619047 
2022-06-05 05:37:23.908 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.9821002386634845 
2022-06-05 05:37:28.906 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.0993939393939394 
2022-06-05 05:37:33.914 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1108462455303934 
2022-06-05 05:37:38.914 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1752827140549273 
2022-06-05 05:37:43.912 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.09697933227345 
2022-06-05 05:37:48.916 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.188861985472155 
2022-06-05 05:37:53.918 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1442193087008343 
2022-06-05 05:37:58.919 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1301535974130963 
2022-06-05 05:38:03.940 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.156597774244833 
2022-06-05 05:38:08.922 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1014198782961462 
2022-06-05 05:38:13.928 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1072705601907031 
2022-06-05 05:38:18.927 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1280290791599352 
2022-06-05 05:38:23.928 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1479713603818615 
2022-06-05 05:38:28.930 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1355932203389831 
2022-06-05 05:38:33.932 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1303656597774245 
2022-06-05 05:38:38.934 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1251513928138879 
2022-06-05 05:38:43.936 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.085385226370135 
2022-06-05 05:38:48.938 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.2227602905569008 
2022-06-05 05:38:53.944 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.0758538522637013 
2022-06-05 05:38:58.941 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1357575757575757 
2022-06-05 05:39:03.947 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.0830023828435265 
2022-06-05 05:39:08.944 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1289409862570736 
2022-06-05 05:39:13.949 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1930870083432659 
2022-06-05 05:39:18.950 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.0989499192245558 
2022-06-05 05:39:23.950 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1801909307875895 
2022-06-05 05:39:28.952 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1973365617433414 
2022-06-05 05:39:33.957 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1028185788011116 
2022-06-05 05:39:38.957 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.0621719822365765 
2022-06-05 05:39:43.959 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1489868891537545 
2022-06-05 05:39:48.961 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1643780290791599 
2022-06-05 05:39:53.966 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1270849880857823 
2022-06-05 05:39:58.965 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.0912394025030279 
2022-06-05 05:40:03.972 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1136724960254372 
2022-06-05 05:40:08.976 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1050080775444264 
2022-06-05 05:40:13.991 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1895113230035756 
2022-06-05 05:40:18.980 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.2218623481781377 
2022-06-05 05:40:23.981 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.0877680698967434 
2022-06-05 05:40:28.981 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1110662358642973 
2022-06-05 05:40:33.984 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1771247021445592 
2022-06-05 05:40:38.986 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1651190956802584 
2022-06-05 05:40:43.988 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1348448687350836 
2022-06-05 05:40:48.992 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1997578692493946 
2022-06-05 05:40:53.992 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.109033028253084 
2022-06-05 05:40:58.998 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.2026645135244247 
2022-06-05 05:41:03.998 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.162485065710872 
2022-06-05 05:41:08.998 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1689571544058206 
2022-06-05 05:41:14.012 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.163411717815863 
2022-06-05 05:41:19.006 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1219709208400646 
2022-06-05 05:41:24.007 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1789137380191694 
2022-06-05 05:41:29.006 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1676067687348912 
2022-06-05 05:41:34.007 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1169193934557062 
2022-06-05 05:41:39.009 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1541247484909456 
2022-06-05 05:41:44.013 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.2385321100917432 
2022-06-05 05:41:49.018 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1355591311343525 
2022-06-05 05:41:54.016 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1034345047923324 
2022-06-05 05:41:59.019 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1163914619412003 
2022-06-05 05:42:04.022 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1376 
2022-06-05 05:42:09.056 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1189710610932475 
2022-06-05 05:42:14.029 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.079757085020243 
2022-06-05 05:42:19.031 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1412520064205458 
2022-06-05 05:42:24.027 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.0481927710843373 
2022-06-05 05:42:29.031 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1641252006420546 
2022-06-05 05:42:34.034 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.0952762209767815 
2022-06-05 05:42:39.039 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.171875 
2022-06-05 05:42:44.037 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1423401688781665 
2022-06-05 05:42:49.041 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.0713426853707415 
2022-06-05 05:42:54.052 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.0769230769230769 
2022-06-05 05:42:59.046 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.0810593900481542 
2022-06-05 05:43:04.046 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1256038647342994 
2022-06-05 05:43:09.062 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1289031224979984 
2022-06-05 05:43:14.050 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1081953976584578 
2022-06-05 05:43:19.050 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.0452127659574468 
2022-06-05 05:43:24.052 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: NaN